Btuncer1/GolfGateEpas/SPC5Golfv2/components/spc58xgxx_platform_component_rla/lib/include/spc58xg_registry.h
/****************************************************************************
*
* Copyright © 2015-2019 STMicroelectronics - All Rights Reserved
*
* This software is licensed under SLA0098 terms that can be found in the
* DM00779817_1_0.pdf file in the licenses directory of this software product.
* 
* THIS SOFTWARE IS DISTRIBUTED "AS IS," AND ALL WARRANTIES ARE DISCLAIMED, 
* INCLUDING MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
*
*****************************************************************************/

/**
 * @file    spc58xg_registry.h
 * @brief   SPC58xGxx capabilities registry.
 *
 * @addtogroup PLATFORM
 * @{
 */

#ifndef SPC5_REGISTRY_H
#define SPC5_REGISTRY_H

/*===========================================================================*/
/* Platform capabilities.                                                    */
/*===========================================================================*/

/**
 * @name    SPC58xGxx capabilities
 * @{
 */
/* eDMA attributes.*/
#define SPC5_HAS_EDMA                       TRUE
#define SPC5_HAS_EDMA0                      TRUE
#define SPC5_HAS_EDMA1                      TRUE
#define SPC5_EDMA_DMA0_BASE                 0xFC0A0000UL
#define SPC5_EDMA_DMA1_BASE                 0xF40A4000UL
#define SPC5_EDMA_NCHANNELS                 96U
#define SPC5_EDMA_COMBO_CH_ERR_HANDLER      vector52
#define SPC5_EDMA_CH0_HANDLER               vector53
#define SPC5_EDMA_CH1_HANDLER               vector54
#define SPC5_EDMA_CH2_HANDLER               vector55
#define SPC5_EDMA_CH3_HANDLER               vector56
#define SPC5_EDMA_CH4_HANDLER               vector57
#define SPC5_EDMA_CH5_HANDLER               vector58
#define SPC5_EDMA_CH6_HANDLER               vector59
#define SPC5_EDMA_CH7_HANDLER               vector60
#define SPC5_EDMA_CH8_HANDLER               vector61
#define SPC5_EDMA_CH9_HANDLER               vector62
#define SPC5_EDMA_CH10_HANDLER              vector63
#define SPC5_EDMA_CH11_HANDLER              vector64
#define SPC5_EDMA_CH12_HANDLER              vector65
#define SPC5_EDMA_CH13_HANDLER              vector66
#define SPC5_EDMA_CH14_HANDLER              vector67
#define SPC5_EDMA_CH15_HANDLER              vector68
#define SPC5_EDMA_CH16_HANDLER              vector69
#define SPC5_EDMA_CH17_HANDLER              vector70
#define SPC5_EDMA_CH18_HANDLER              vector71
#define SPC5_EDMA_CH19_HANDLER              vector72
#define SPC5_EDMA_CH20_HANDLER              vector73
#define SPC5_EDMA_CH21_HANDLER              vector74
#define SPC5_EDMA_CH22_HANDLER              vector75
#define SPC5_EDMA_CH23_HANDLER              vector76
#define SPC5_EDMA_CH24_HANDLER              vector77
#define SPC5_EDMA_CH25_HANDLER              vector78
#define SPC5_EDMA_CH26_HANDLER              vector79
#define SPC5_EDMA_CH27_HANDLER              vector80
#define SPC5_EDMA_CH28_HANDLER              vector81
#define SPC5_EDMA_CH29_HANDLER              vector82
#define SPC5_EDMA_CH30_HANDLER              vector83
#define SPC5_EDMA_CH31_HANDLER              vector84
#define SPC5_EDMA_CH32_HANDLER              vector85
#define SPC5_EDMA_CH33_HANDLER              vector86
#define SPC5_EDMA_CH34_HANDLER              vector87
#define SPC5_EDMA_CH35_HANDLER              vector88
#define SPC5_EDMA_CH36_HANDLER              vector89
#define SPC5_EDMA_CH37_HANDLER              vector90
#define SPC5_EDMA_CH38_HANDLER              vector91
#define SPC5_EDMA_CH39_HANDLER              vector92
#define SPC5_EDMA_CH40_HANDLER              vector93
#define SPC5_EDMA_CH41_HANDLER              vector94
#define SPC5_EDMA_CH42_HANDLER              vector95
#define SPC5_EDMA_CH43_HANDLER              vector96
#define SPC5_EDMA_CH44_HANDLER              vector97
#define SPC5_EDMA_CH45_HANDLER              vector98
#define SPC5_EDMA_CH46_HANDLER              vector99
#define SPC5_EDMA_CH47_HANDLER              vector100
#define SPC5_EDMA_CH48_HANDLER              vector101
#define SPC5_EDMA_CH49_HANDLER              vector102
#define SPC5_EDMA_CH50_HANDLER              vector103
#define SPC5_EDMA_CH51_HANDLER              vector104
#define SPC5_EDMA_CH52_HANDLER              vector105
#define SPC5_EDMA_CH53_HANDLER              vector106
#define SPC5_EDMA_CH54_HANDLER              vector107
#define SPC5_EDMA_CH55_HANDLER              vector108
#define SPC5_EDMA_CH56_HANDLER              vector109
#define SPC5_EDMA_CH57_HANDLER              vector110
#define SPC5_EDMA_CH58_HANDLER              vector111
#define SPC5_EDMA_CH59_HANDLER              vector112
#define SPC5_EDMA_CH60_HANDLER              vector113
#define SPC5_EDMA_CH61_HANDLER              vector114
#define SPC5_EDMA_CH62_HANDLER              vector115
#define SPC5_EDMA_CH63_HANDLER              vector116
#define SPC5_EDMA_CH64_HANDLER              vector117
#define SPC5_EDMA_CH65_HANDLER              vector118
#define SPC5_EDMA_CH66_HANDLER              vector119
#define SPC5_EDMA_CH67_HANDLER              vector120
#define SPC5_EDMA_CH68_HANDLER              vector121
#define SPC5_EDMA_CH69_HANDLER              vector122
#define SPC5_EDMA_CH70_HANDLER              vector123
#define SPC5_EDMA_CH71_HANDLER              vector124
#define SPC5_EDMA_CH72_HANDLER              vector125
#define SPC5_EDMA_CH73_HANDLER              vector126
#define SPC5_EDMA_CH74_HANDLER              vector127
#define SPC5_EDMA_CH75_HANDLER              vector128
#define SPC5_EDMA_CH76_HANDLER              vector129
#define SPC5_EDMA_CH77_HANDLER              vector130
#define SPC5_EDMA_CH78_HANDLER              vector131
#define SPC5_EDMA_CH79_HANDLER              vector132
#define SPC5_EDMA_CH80_HANDLER              vector133
#define SPC5_EDMA_CH81_HANDLER              vector134
#define SPC5_EDMA_CH82_HANDLER              vector135
#define SPC5_EDMA_CH83_HANDLER              vector136
#define SPC5_EDMA_CH84_HANDLER              vector137
#define SPC5_EDMA_CH85_HANDLER              vector138
#define SPC5_EDMA_CH86_HANDLER              vector139
#define SPC5_EDMA_CH87_HANDLER              vector140
#define SPC5_EDMA_CH88_HANDLER              vector141
#define SPC5_EDMA_CH89_HANDLER              vector142
#define SPC5_EDMA_CH90_HANDLER              vector143
#define SPC5_EDMA_CH91_HANDLER              vector144
#define SPC5_EDMA_CH92_HANDLER              vector145
#define SPC5_EDMA_CH93_HANDLER              vector146
#define SPC5_EDMA_CH94_HANDLER              vector147
#define SPC5_EDMA_CH95_HANDLER              vector148
#define SPC5_EDMA_COMBO_CH_ERR_NUMBER       52U
#define SPC5_EDMA_CH0_NUMBER                53U
#define SPC5_EDMA_HAS_MUX                   TRUE
#define SPC5_EDMA_NUM_OF_MUX                6U
#define SPC5_EDMA_MUX0_BASE                 0xF7F6C000UL
#define SPC5_EDMA_MUX0_CH_NUM               16U
#define SPC5_EDMA_MUX1_BASE                 0xFBF6C000UL
#define SPC5_EDMA_MUX1_CH_NUM               16U
#define SPC5_EDMA_MUX2_BASE                 0xF7F6C200UL
#define SPC5_EDMA_MUX2_CH_NUM               16U
#define SPC5_EDMA_MUX3_BASE                 0xFBF6C200UL
#define SPC5_EDMA_MUX3_CH_NUM               16U
#define SPC5_EDMA_MUX4_BASE                 0xF7F6C400UL
#define SPC5_EDMA_MUX4_CH_NUM               16U
#define SPC5_EDMA_MUX5_BASE                 0xFBF6C400UL
#define SPC5_EDMA_MUX5_CH_NUM               16U
#define SPC5_EDMA_MUX0_PCTL                 36
#define SPC5_EDMA_MUX1_PCTL                 164

/* DSPI attributes.*/
#define SPC5_HAS_DSPI0                      TRUE
#define SPC5_DSPI0_BASE                     0xF7E70000UL
#define SPC5_HAS_DSPI1                      TRUE
#define SPC5_DSPI1_BASE                     0xFBE70000UL
#define SPC5_HAS_DSPI2                      TRUE
#define SPC5_DSPI2_BASE                     0xF7E74000UL
#define SPC5_HAS_DSPI3                      TRUE
#define SPC5_DSPI3_BASE                     0xFBE74000UL
#define SPC5_HAS_DSPI4                      TRUE
#define SPC5_DSPI4_BASE                     0xF7E78000UL
#define SPC5_HAS_DSPI5                      TRUE
#define SPC5_DSPI5_BASE                     0xFBE78000UL
#define SPC5_HAS_DSPI6                      TRUE
#define SPC5_DSPI6_BASE                     0xF7E7C000UL
#define SPC5_HAS_DSPI7                      TRUE
#define SPC5_DSPI7_BASE                     0xFBE7C000UL
#define SPC5_HAS_DSPI8                      TRUE
#define SPC5_DSPI8_BASE                     0xF7E80000UL
#define SPC5_HAS_DSPI9                      TRUE
#define SPC5_DSPI9_BASE                     0xFBE80000UL

