Btuncer1/GolfGateEpas/SPC5Golfv2/components/spc58xgxx_platform_component_rla/lib/include/spc58xg_registry.h
#define SPC5_DSPI_FIFO_DEPTH                4U
#define SPC5_DSPI0_EOQF_HANDLER             vector260
#define SPC5_DSPI0_EOQF_NUMBER              260
#define SPC5_DSPI0_TFFF_HANDLER             vector261
#define SPC5_DSPI0_TFFF_NUMBER              261
#define SPC5_DSPI0_RFDF_HANDLER             vector263
#define SPC5_DSPI0_RFDF_NUMBER              263

#define SPC5_DSPI1_EOQF_HANDLER             vector269
#define SPC5_DSPI1_EOQF_NUMBER              269
#define SPC5_DSPI1_TFFF_HANDLER             vector270
#define SPC5_DSPI1_TFFF_NUMBER              270
#define SPC5_DSPI1_RFDF_HANDLER             vector272
#define SPC5_DSPI1_RFDF_NUMBER              272

#define SPC5_DSPI2_EOQF_HANDLER             vector278
#define SPC5_DSPI2_EOQF_NUMBER              278
#define SPC5_DSPI2_TFFF_HANDLER             vector279
#define SPC5_DSPI2_TFFF_NUMBER              279
#define SPC5_DSPI2_RFDF_HANDLER             vector281
#define SPC5_DSPI2_RFDF_NUMBER              281

#define SPC5_DSPI3_EOQF_HANDLER             vector287
#define SPC5_DSPI3_EOQF_NUMBER              287
#define SPC5_DSPI3_TFFF_HANDLER             vector288
#define SPC5_DSPI3_TFFF_NUMBER              288
#define SPC5_DSPI3_RFDF_HANDLER             vector290
#define SPC5_DSPI3_RFDF_NUMBER              290

#define SPC5_DSPI4_EOQF_HANDLER             vector296
#define SPC5_DSPI4_EOQF_NUMBER              296
#define SPC5_DSPI4_TFFF_HANDLER             vector297
#define SPC5_DSPI4_TFFF_NUMBER              297
#define SPC5_DSPI4_RFDF_HANDLER             vector299
#define SPC5_DSPI4_RFDF_NUMBER              299

#define SPC5_DSPI5_EOQF_HANDLER             vector305
#define SPC5_DSPI5_EOQF_NUMBER              305
#define SPC5_DSPI5_TFFF_HANDLER             vector306
#define SPC5_DSPI5_TFFF_NUMBER              306
#define SPC5_DSPI5_RFDF_HANDLER             vector308
#define SPC5_DSPI5_RFDF_NUMBER              308

#define SPC5_DSPI6_EOQF_HANDLER             vector314
#define SPC5_DSPI6_EOQF_NUMBER              314
#define SPC5_DSPI6_TFFF_HANDLER             vector315
#define SPC5_DSPI6_TFFF_NUMBER              315
#define SPC5_DSPI6_RFDF_HANDLER             vector317
#define SPC5_DSPI6_RFDF_NUMBER              317

#define SPC5_DSPI7_EOQF_HANDLER             vector323
#define SPC5_DSPI7_EOQF_NUMBER              323
#define SPC5_DSPI7_TFFF_HANDLER             vector324
#define SPC5_DSPI7_TFFF_NUMBER              324
#define SPC5_DSPI7_RFDF_HANDLER             vector326
#define SPC5_DSPI7_RFDF_NUMBER              326

#define SPC5_DSPI8_EOQF_HANDLER             vector332
#define SPC5_DSPI8_EOQF_NUMBER              332
#define SPC5_DSPI8_TFFF_HANDLER             vector333
#define SPC5_DSPI8_TFFF_NUMBER              333
#define SPC5_DSPI8_RFDF_HANDLER             vector335
#define SPC5_DSPI8_RFDF_NUMBER              335

#define SPC5_DSPI9_EOQF_HANDLER             vector341
#define SPC5_DSPI9_EOQF_NUMBER              341
#define SPC5_DSPI9_TFFF_HANDLER             vector342
#define SPC5_DSPI9_TFFF_NUMBER              342
#define SPC5_DSPI9_RFDF_HANDLER             vector344
#define SPC5_DSPI9_RFDF_NUMBER              344

#define SPC5_DSPI0_PCTL                     99
#define SPC5_DSPI1_PCTL                     227
#define SPC5_DSPI2_PCTL                     98
#define SPC5_DSPI3_PCTL                     226
#define SPC5_DSPI4_PCTL                     97
#define SPC5_DSPI5_PCTL                     225
#define SPC5_DSPI6_PCTL                     96
#define SPC5_DSPI7_PCTL                     224
#define SPC5_DSPI8_PCTL                     95
#define SPC5_DSPI9_PCTL                     223

#define SPC5_DSPI0_RX_DMA_MUX0_DEV_ID       3
#define SPC5_DSPI0_TX1_DMA_MUX0_DEV_ID      4
#define SPC5_DSPI0_TX2_DMA_MUX0_DEV_ID      5

#define SPC5_DSPI1_RX_DMA_MUX0_DEV_ID       6
#define SPC5_DSPI1_TX1_DMA_MUX0_DEV_ID      7
#define SPC5_DSPI1_TX2_DMA_MUX0_DEV_ID      8

#define SPC5_DSPI2_RX_DMA_MUX1_DEV_ID       4
#define SPC5_DSPI2_TX1_DMA_MUX1_DEV_ID      5
#define SPC5_DSPI2_TX2_DMA_MUX1_DEV_ID      6

#define SPC5_DSPI3_RX_DMA_MUX1_DEV_ID       7
#define SPC5_DSPI3_TX1_DMA_MUX1_DEV_ID      8
#define SPC5_DSPI3_TX2_DMA_MUX1_DEV_ID      9

#define SPC5_DSPI4_RX_DMA_MUX0_DEV_ID       9
#define SPC5_DSPI4_RX_DMA_MUX2_DEV_ID       13
#define SPC5_DSPI4_TX1_DMA_MUX0_DEV_ID      10
#define SPC5_DSPI4_TX1_DMA_MUX2_DEV_ID      14
#define SPC5_DSPI4_TX2_DMA_MUX0_DEV_ID      11
#define SPC5_DSPI4_TX2_DMA_MUX2_DEV_ID      15

#define SPC5_DSPI5_RX_DMA_MUX0_DEV_ID       12
#define SPC5_DSPI5_RX_DMA_MUX3_DEV_ID       13
#define SPC5_DSPI5_TX1_DMA_MUX0_DEV_ID      13
#define SPC5_DSPI5_TX1_DMA_MUX3_DEV_ID      14
#define SPC5_DSPI5_TX2_DMA_MUX0_DEV_ID      14
#define SPC5_DSPI5_TX2_DMA_MUX3_DEV_ID      15

#define SPC5_DSPI6_RX_DMA_MUX1_DEV_ID       10
#define SPC5_DSPI6_TX1_DMA_MUX1_DEV_ID      11
#define SPC5_DSPI6_TX2_DMA_MUX1_DEV_ID      12

#define SPC5_DSPI7_RX_DMA_MUX1_DEV_ID       13
#define SPC5_DSPI7_TX1_DMA_MUX1_DEV_ID      14
#define SPC5_DSPI7_TX2_DMA_MUX1_DEV_ID      15

#define SPC5_DSPI8_RX_DMA_MUX2_DEV_ID       4
#define SPC5_DSPI8_TX1_DMA_MUX2_DEV_ID      5
#define SPC5_DSPI8_TX2_DMA_MUX2_DEV_ID      6

#define SPC5_DSPI9_RX_DMA_MUX3_DEV_ID       4
#define SPC5_DSPI9_TX1_DMA_MUX3_DEV_ID      5
#define SPC5_DSPI9_TX2_DMA_MUX3_DEV_ID      6

#define SPC5_DSPI0_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_SPI_DSPI0_START_PCTL)
#define SPC5_DSPI0_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI0_PCTL, SPC5_SPI_DSPI0_STOP_PCTL)
#define SPC5_DSPI1_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_SPI_DSPI1_START_PCTL)
#define SPC5_DSPI1_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI1_PCTL, SPC5_SPI_DSPI1_STOP_PCTL)
#define SPC5_DSPI2_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_SPI_DSPI2_START_PCTL)
#define SPC5_DSPI2_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI2_PCTL, SPC5_SPI_DSPI2_STOP_PCTL)
#define SPC5_DSPI3_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_SPI_DSPI3_START_PCTL)
#define SPC5_DSPI3_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI3_PCTL, SPC5_SPI_DSPI3_STOP_PCTL)
#define SPC5_DSPI4_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI4_PCTL, SPC5_SPI_DSPI4_START_PCTL)
#define SPC5_DSPI4_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI4_PCTL, SPC5_SPI_DSPI4_STOP_PCTL)
#define SPC5_DSPI5_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI5_PCTL, SPC5_SPI_DSPI5_START_PCTL)
#define SPC5_DSPI5_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI5_PCTL, SPC5_SPI_DSPI5_STOP_PCTL)
#define SPC5_DSPI6_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI6_PCTL, SPC5_SPI_DSPI6_START_PCTL)
#define SPC5_DSPI6_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI6_PCTL, SPC5_SPI_DSPI6_STOP_PCTL)
#define SPC5_DSPI7_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI7_PCTL, SPC5_SPI_DSPI7_START_PCTL)
#define SPC5_DSPI7_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI7_PCTL, SPC5_SPI_DSPI7_STOP_PCTL)
#define SPC5_DSPI8_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI8_PCTL, SPC5_SPI_DSPI8_START_PCTL)
#define SPC5_DSPI8_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI8_PCTL, SPC5_SPI_DSPI8_STOP_PCTL)
#define SPC5_DSPI9_ENABLE_CLOCK()                                           \
  SPCSetPeripheralClockMode(SPC5_DSPI9_PCTL, SPC5_SPI_DSPI9_START_PCTL)
#define SPC5_DSPI9_DISABLE_CLOCK()                                          \
  SPCSetPeripheralClockMode(SPC5_DSPI9_PCTL, SPC5_SPI_DSPI9_STOP_PCTL)

/* LINFlex attributes.*/
#define SPC5_HAS_LINFLEX0                   TRUE
#define SPC5_LINFLEX0_BASE                  0xF7E8C000UL
#define SPC5_LINFLEX0L_BASE                 0xF7E8C000UL
#define SPC5_LINFLEX0H_BASE                 0xF7E8C08CUL
#define SPC5_LINFLEX0_PCTL                  92
#define SPC5_LINFLEX0_RXI_HANDLER           vector376
#define SPC5_LINFLEX0_TXI_HANDLER           vector377
#define SPC5_LINFLEX0_ERR_HANDLER           vector378
#define SPC5_LINFLEX0_RXI_NUMBER            376
#define SPC5_LINFLEX0_TXI_NUMBER            377
#define SPC5_LINFLEX0_ERR_NUMBER            378
#define SPC5_LINFLEX0_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX0_RX_DMA_MUX0_DEV_ID    15
#define SPC5_LINFLEX0_RX_DMA_MUX4_DEV_ID    20
#define SPC5_LINFLEX0_TX_DMA_MUX0_DEV_ID    16
#define SPC5_LINFLEX0_TX_DMA_MUX4_DEV_ID    21
#define SPC5_LINFLEX0_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX1                   TRUE
#define SPC5_LINFLEX1_BASE                  0xFBE8C000UL
#define SPC5_LINFLEX1L_BASE                 0xFBE8C000UL
#define SPC5_LINFLEX1H_BASE                 0xFBE8C08CUL
#define SPC5_LINFLEX1_PCTL                  220
#define SPC5_LINFLEX1_RXI_HANDLER           vector380
#define SPC5_LINFLEX1_TXI_HANDLER           vector381
#define SPC5_LINFLEX1_ERR_HANDLER           vector382
#define SPC5_LINFLEX1_RXI_NUMBER            380
#define SPC5_LINFLEX1_TXI_NUMBER            381
#define SPC5_LINFLEX1_ERR_NUMBER            382
#define SPC5_LINFLEX1_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX1_RX_DMA_MUX0_DEV_ID    17
#define SPC5_LINFLEX1_RX_DMA_MUX4_DEV_ID    22
#define SPC5_LINFLEX1_TX_DMA_MUX0_DEV_ID    18
#define SPC5_LINFLEX1_TX_DMA_MUX4_DEV_ID    23
#define SPC5_LINFLEX1_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX2                   TRUE
#define SPC5_LINFLEX2_BASE                  0xF7E90000UL
#define SPC5_LINFLEX2L_BASE                 0xF7E90000UL
#define SPC5_LINFLEX2H_BASE                 0xF7E9008CUL
#define SPC5_LINFLEX2_PCTL                  91
#define SPC5_LINFLEX2_RXI_HANDLER           vector384
#define SPC5_LINFLEX2_TXI_HANDLER           vector385
#define SPC5_LINFLEX2_ERR_HANDLER           vector386
#define SPC5_LINFLEX2_RXI_NUMBER            384
#define SPC5_LINFLEX2_TXI_NUMBER            385
#define SPC5_LINFLEX2_ERR_NUMBER            386
#define SPC5_LINFLEX2_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX2_RX_DMA_MUX0_DEV_ID    19
#define SPC5_LINFLEX2_RX_DMA_MUX5_DEV_ID    20
#define SPC5_LINFLEX2_TX_DMA_MUX0_DEV_ID    20
#define SPC5_LINFLEX2_TX_DMA_MUX5_DEV_ID    21
#define SPC5_LINFLEX2_CLK                   SPC5_LIN_CLK0

