Btuncer1/GolfGateEpas/SPC5Golfv2/components/spc58xgxx_platform_component_rla/lib/include/spc58xg_registry.h
#define SPC5_HAS_LINFLEX3                   TRUE
#define SPC5_LINFLEX3_BASE                  0xFBE90000UL
#define SPC5_LINFLEX3L_BASE                 0xFBE90000UL
#define SPC5_LINFLEX3H_BASE                 0xFBE9008CUL
#define SPC5_LINFLEX3_PCTL                  219
#define SPC5_LINFLEX3_RXI_HANDLER           vector388
#define SPC5_LINFLEX3_TXI_HANDLER           vector389
#define SPC5_LINFLEX3_ERR_HANDLER           vector390
#define SPC5_LINFLEX3_RXI_NUMBER            388
#define SPC5_LINFLEX3_TXI_NUMBER            389
#define SPC5_LINFLEX3_ERR_NUMBER            390
#define SPC5_LINFLEX3_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX3_RX_DMA_MUX0_DEV_ID    21
#define SPC5_LINFLEX3_TX_DMA_MUX0_DEV_ID    22
#define SPC5_LINFLEX3_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX4                   TRUE
#define SPC5_LINFLEX4_BASE                  0xF7E94000UL
#define SPC5_LINFLEX4L_BASE                 0xF7E94000UL
#define SPC5_LINFLEX4H_BASE                 0xF7E9408CUL
#define SPC5_LINFLEX4_PCTL                  90
#define SPC5_LINFLEX4_RXI_HANDLER           vector392
#define SPC5_LINFLEX4_TXI_HANDLER           vector393
#define SPC5_LINFLEX4_ERR_HANDLER           vector394
#define SPC5_LINFLEX4_RXI_NUMBER            392
#define SPC5_LINFLEX4_TXI_NUMBER            393
#define SPC5_LINFLEX4_ERR_NUMBER            394
#define SPC5_LINFLEX4_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX4_RX_DMA_MUX0_DEV_ID    23
#define SPC5_LINFLEX4_TX_DMA_MUX0_DEV_ID    24
#define SPC5_LINFLEX4_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX5                   TRUE
#define SPC5_LINFLEX5_BASE                  0xFBE94000UL
#define SPC5_LINFLEX5L_BASE                 0xFBE94000UL
#define SPC5_LINFLEX5H_BASE                 0xFBE9408CUL
#define SPC5_LINFLEX5_PCTL                  218
#define SPC5_LINFLEX5_RXI_HANDLER           vector396
#define SPC5_LINFLEX5_TXI_HANDLER           vector397
#define SPC5_LINFLEX5_ERR_HANDLER           vector398
#define SPC5_LINFLEX5_RXI_NUMBER            396
#define SPC5_LINFLEX5_TXI_NUMBER            397
#define SPC5_LINFLEX5_ERR_NUMBER            398
#define SPC5_LINFLEX5_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX5_RX_DMA_MUX0_DEV_ID    25
#define SPC5_LINFLEX5_TX_DMA_MUX0_DEV_ID    26
#define SPC5_LINFLEX5_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX6                   TRUE
#define SPC5_LINFLEX6_BASE                  0xF7E98000UL
#define SPC5_LINFLEX6L_BASE                 0xF7E98000UL
#define SPC5_LINFLEX6H_BASE                 0xF7E9808CUL
#define SPC5_LINFLEX6_PCTL                  89
#define SPC5_LINFLEX6_RXI_HANDLER           vector400
#define SPC5_LINFLEX6_TXI_HANDLER           vector401
#define SPC5_LINFLEX6_ERR_HANDLER           vector402
#define SPC5_LINFLEX6_RXI_NUMBER            400
#define SPC5_LINFLEX6_TXI_NUMBER            401
#define SPC5_LINFLEX6_ERR_NUMBER            402
#define SPC5_LINFLEX6_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX6_RX_DMA_MUX1_DEV_ID    16
#define SPC5_LINFLEX6_TX_DMA_MUX1_DEV_ID    17
#define SPC5_LINFLEX6_CLK                   SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX7                   TRUE
#define SPC5_LINFLEX7_BASE                  0xFBE98000UL
#define SPC5_LINFLEX7L_BASE                 0xFBE98000UL
#define SPC5_LINFLEX7H_BASE                 0xFBE9808CUL
#define SPC5_LINFLEX7_PCTL                  217
#define SPC5_LINFLEX7_RXI_HANDLER           vector404
#define SPC5_LINFLEX7_TXI_HANDLER           vector405
#define SPC5_LINFLEX7_ERR_HANDLER           vector406
#define SPC5_LINFLEX7_RXI_NUMBER            404
#define SPC5_LINFLEX7_TXI_NUMBER            405
#define SPC5_LINFLEX7_ERR_NUMBER            406
#define SPC5_LINFLEX7_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX7_RX_DMA_MUX1_DEV_ID    18
#define SPC5_LINFLEX7_TX_DMA_MUX1_DEV_ID    19
#define SPC5_LINFLEX7_CLK                   SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX8                   TRUE
#define SPC5_LINFLEX8_BASE                  0xF7E9C000UL
#define SPC5_LINFLEX8L_BASE                 0xF7E9C000UL
#define SPC5_LINFLEX8H_BASE                 0xF7E9C08CUL
#define SPC5_LINFLEX8_PCTL                  88
#define SPC5_LINFLEX8_RXI_HANDLER           vector408
#define SPC5_LINFLEX8_TXI_HANDLER           vector409
#define SPC5_LINFLEX8_ERR_HANDLER           vector410
#define SPC5_LINFLEX8_RXI_NUMBER            408
#define SPC5_LINFLEX8_TXI_NUMBER            409
#define SPC5_LINFLEX8_ERR_NUMBER            410
#define SPC5_LINFLEX8_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX8_RX_DMA_MUX1_DEV_ID    20
#define SPC5_LINFLEX8_TX_DMA_MUX1_DEV_ID    21
#define SPC5_LINFLEX8_CLK                   SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX9                   TRUE
#define SPC5_LINFLEX9_BASE                  0xFBE9C000UL
#define SPC5_LINFLEX9L_BASE                 0xFBE9C000UL
#define SPC5_LINFLEX9H_BASE                 0xFBE9C08CUL
#define SPC5_LINFLEX9_PCTL                  216
#define SPC5_LINFLEX9_RXI_HANDLER           vector412
#define SPC5_LINFLEX9_TXI_HANDLER           vector413
#define SPC5_LINFLEX9_ERR_HANDLER           vector414
#define SPC5_LINFLEX9_RXI_NUMBER            412
#define SPC5_LINFLEX9_TXI_NUMBER            413
#define SPC5_LINFLEX9_ERR_NUMBER            414
#define SPC5_LINFLEX9_DMA_SUPPORTED         TRUE
#define SPC5_LINFLEX9_RX_DMA_MUX1_DEV_ID    22
#define SPC5_LINFLEX9_TX_DMA_MUX1_DEV_ID    23
#define SPC5_LINFLEX9_CLK                   SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX10                  TRUE
#define SPC5_LINFLEX10_BASE                 0xF7EA0000UL
#define SPC5_LINFLEX10L_BASE                0xF7EA0000UL
#define SPC5_LINFLEX10H_BASE                0xF7EA008CUL
#define SPC5_LINFLEX10_PCTL                 87
#define SPC5_LINFLEX10_RXI_HANDLER          vector416
#define SPC5_LINFLEX10_TXI_HANDLER          vector417
#define SPC5_LINFLEX10_ERR_HANDLER          vector418
#define SPC5_LINFLEX10_RXI_NUMBER           416
#define SPC5_LINFLEX10_TXI_NUMBER           417
#define SPC5_LINFLEX10_ERR_NUMBER           418
#define SPC5_LINFLEX10_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX10_RX_DMA_MUX1_DEV_ID   24
#define SPC5_LINFLEX10_TX_DMA_MUX1_DEV_ID   25
#define SPC5_LINFLEX10_CLK                  SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX11                  TRUE
#define SPC5_LINFLEX11_BASE                 0xFBEA0000UL
#define SPC5_LINFLEX11L_BASE                0xFBEA0000UL
#define SPC5_LINFLEX11H_BASE                0xFBEA008CUL
#define SPC5_LINFLEX11_PCTL                 215
#define SPC5_LINFLEX11_RXI_HANDLER          vector420
#define SPC5_LINFLEX11_TXI_HANDLER          vector421
#define SPC5_LINFLEX11_ERR_HANDLER          vector422
#define SPC5_LINFLEX11_RXI_NUMBER           420
#define SPC5_LINFLEX11_TXI_NUMBER           421
#define SPC5_LINFLEX11_ERR_NUMBER           422
#define SPC5_LINFLEX11_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX11_RX_DMA_MUX1_DEV_ID   26
#define SPC5_LINFLEX11_TX_DMA_MUX1_DEV_ID   27
#define SPC5_LINFLEX11_CLK                  SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX12                  TRUE
#define SPC5_LINFLEX12_BASE                 0xF7EA4000UL
#define SPC5_LINFLEX12L_BASE                0xF7EA4000UL
#define SPC5_LINFLEX12H_BASE                0xF7EA408CUL
#define SPC5_LINFLEX12_PCTL                 86
#define SPC5_LINFLEX12_RXI_HANDLER          vector424
#define SPC5_LINFLEX12_TXI_HANDLER          vector425
#define SPC5_LINFLEX12_ERR_HANDLER          vector426
#define SPC5_LINFLEX12_RXI_NUMBER           424
#define SPC5_LINFLEX12_TXI_NUMBER           425
#define SPC5_LINFLEX12_ERR_NUMBER           426
#define SPC5_LINFLEX12_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX12_RX_DMA_MUX2_DEV_ID   7
#define SPC5_LINFLEX12_TX_DMA_MUX2_DEV_ID   8
#define SPC5_LINFLEX12_CLK                  SPC5_LIN_CLK1

#define SPC5_HAS_LINFLEX13                  TRUE
#define SPC5_LINFLEX13_BASE                 0xFBEA4000UL
#define SPC5_LINFLEX13L_BASE                0xFBEA4000UL
#define SPC5_LINFLEX13H_BASE                0xFBEA408CUL
#define SPC5_LINFLEX13_PCTL                 214
#define SPC5_LINFLEX13_RXI_HANDLER          vector428
#define SPC5_LINFLEX13_TXI_HANDLER          vector429
#define SPC5_LINFLEX13_ERR_HANDLER          vector430
#define SPC5_LINFLEX13_RXI_NUMBER           428
#define SPC5_LINFLEX13_TXI_NUMBER           429
#define SPC5_LINFLEX13_ERR_NUMBER           430
#define SPC5_LINFLEX13_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX13_RX_DMA_MUX3_DEV_ID   7
#define SPC5_LINFLEX13_TX_DMA_MUX3_DEV_ID   8
#define SPC5_LINFLEX13_CLK                  SPC5_LIN_CLK1

