Btuncer1/GolfGateEpas/SPC5Golfv2/components/spc58xgxx_platform_component_rla/lib/include/spc58xg_registry.h
#define SPC5_HAS_LINFLEX14                  TRUE
#define SPC5_LINFLEX14_BASE                 0xF7EA8000UL
#define SPC5_LINFLEX14L_BASE                0xF7EA8000UL
#define SPC5_LINFLEX14H_BASE                0xF7EA808CUL
#define SPC5_LINFLEX14_PCTL                 85
#define SPC5_LINFLEX14_RXI_HANDLER          vector432
#define SPC5_LINFLEX14_TXI_HANDLER          vector433
#define SPC5_LINFLEX14_ERR_HANDLER          vector434
#define SPC5_LINFLEX14_RXI_NUMBER           432
#define SPC5_LINFLEX14_TXI_NUMBER           433
#define SPC5_LINFLEX14_ERR_NUMBER           434
#define SPC5_LINFLEX14_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX14_RX_DMA_MUX2_DEV_ID   9
#define SPC5_LINFLEX14_TX_DMA_MUX2_DEV_ID   10
#define SPC5_LINFLEX14_CLK                  SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX15                  TRUE
#define SPC5_LINFLEX15_BASE                 0xFBEA8000UL
#define SPC5_LINFLEX15L_BASE                0xFBEA8000UL
#define SPC5_LINFLEX15H_BASE                0xFBEA808CUL
#define SPC5_LINFLEX15_PCTL                 213
#define SPC5_LINFLEX15_RXI_HANDLER          vector436
#define SPC5_LINFLEX15_TXI_HANDLER          vector437
#define SPC5_LINFLEX15_ERR_HANDLER          vector438
#define SPC5_LINFLEX15_RXI_NUMBER           436
#define SPC5_LINFLEX15_TXI_NUMBER           437
#define SPC5_LINFLEX15_ERR_NUMBER           438
#define SPC5_LINFLEX15_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX15_RX_DMA_MUX3_DEV_ID   9
#define SPC5_LINFLEX15_TX_DMA_MUX3_DEV_ID   10
#define SPC5_LINFLEX15_CLK                  SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX16                  TRUE
#define SPC5_LINFLEX16_BASE                 0xF7EAC000UL
#define SPC5_LINFLEX16L_BASE                0xF7EAC000UL
#define SPC5_LINFLEX16H_BASE                0xF7EAC08CUL
#define SPC5_LINFLEX16_PCTL                 84
#define SPC5_LINFLEX16_RXI_HANDLER          vector442
#define SPC5_LINFLEX16_TXI_HANDLER          vector443
#define SPC5_LINFLEX16_ERR_HANDLER          vector444
#define SPC5_LINFLEX16_RXI_NUMBER           442
#define SPC5_LINFLEX16_TXI_NUMBER           443
#define SPC5_LINFLEX16_ERR_NUMBER           444
#define SPC5_LINFLEX16_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX16_RX_DMA_MUX4_DEV_ID   55
#define SPC5_LINFLEX16_TX_DMA_MUX4_DEV_ID   56
#define SPC5_LINFLEX16_CLK                  SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX17                  TRUE
#define SPC5_LINFLEX17_BASE                 0xFBEAC000UL
#define SPC5_LINFLEX17L_BASE                0xFBEAC000UL
#define SPC5_LINFLEX17H_BASE                0xFBEAC08CUL
#define SPC5_LINFLEX17_PCTL                 212
#define SPC5_LINFLEX17_RXI_HANDLER          vector446
#define SPC5_LINFLEX17_TXI_HANDLER          vector447
#define SPC5_LINFLEX17_ERR_HANDLER          vector448
#define SPC5_LINFLEX17_RXI_NUMBER           446
#define SPC5_LINFLEX17_TXI_NUMBER           447
#define SPC5_LINFLEX17_ERR_NUMBER           448
#define SPC5_LINFLEX17_DMA_SUPPORTED        TRUE
#define SPC5_LINFLEX17_RX_DMA_MUX5_DEV_ID   55
#define SPC5_LINFLEX17_TX_DMA_MUX5_DEV_ID   56
#define SPC5_LINFLEX17_CLK                  SPC5_LIN_CLK0

#define SPC5_HAS_LINFLEX18                  FALSE
#define SPC5_HAS_LINFLEX19                  FALSE
#define SPC5_HAS_LINFLEX20                  FALSE
#define SPC5_HAS_LINFLEX21                  FALSE
#define SPC5_HAS_LINFLEX22                  FALSE
#define SPC5_HAS_LINFLEX23                  FALSE

/* SIUL2 attributes.*/
#define SPC5_HAS_SIUL2                      TRUE
#define SPC5_HAS_SIUL_PARALLEL_PORT_REG     TRUE
#define SPC5_SIUL2_PCTL                     15
#define SPC5_SIUL2_NUM_PORTS                13
#define SPC5_SIUL2_NUM_MUXES                466

/* PIT Attributes. PITv2 driver support*/
#define SPC5_HAS_PIT0                       TRUE
#define SPC5_PIT0_BASE                      0xF7F84000UL
#define SPC5_PIT0_CHANNELS                  8
#define SPC5_PIT0_PCTL                      30
#define SPC5_PIT0_ENABLE_CLOCK()            SPCSetPeripheralClockMode(SPC5_PIT0_PCTL, SPC5_PIT0_START_PCTL);
#define SPC5_PIT0_DISABLE_CLOCK()           SPCSetPeripheralClockMode(SPC5_PIT0_PCTL, SPC5_PIT0_STOP_PCTL);
#define SPC5_HAS_PIT0_CH0                   TRUE
#define SPC5_HAS_PIT0_CH1                   TRUE
#define SPC5_HAS_PIT0_CH2                   TRUE
#define SPC5_HAS_PIT0_CH3                   TRUE
#define SPC5_HAS_PIT0_CH4                   TRUE
#define SPC5_HAS_PIT0_CH5                   TRUE
#define SPC5_HAS_PIT0_CH6                   TRUE
#define SPC5_HAS_PIT0_CH7                   TRUE
#define SPC5_PIT0_CH0_HANDLER               vector226
#define SPC5_PIT0_CH1_HANDLER               vector227
#define SPC5_PIT0_CH2_HANDLER               vector228
#define SPC5_PIT0_CH3_HANDLER               vector229
#define SPC5_PIT0_CH4_HANDLER               vector230
#define SPC5_PIT0_CH5_HANDLER               vector231
#define SPC5_PIT0_CH6_HANDLER               vector232
#define SPC5_PIT0_CH7_HANDLER               vector233
#define SPC5_PIT0_CH0_INT_NUMBER            226
#define SPC5_PIT0_CH1_INT_NUMBER            227
#define SPC5_PIT0_CH2_INT_NUMBER            228
#define SPC5_PIT0_CH3_INT_NUMBER            229
#define SPC5_PIT0_CH4_INT_NUMBER            230
#define SPC5_PIT0_CH5_INT_NUMBER            231
#define SPC5_PIT0_CH6_INT_NUMBER            232
#define SPC5_PIT0_CH7_INT_NUMBER            233

#define SPC5_HAS_PIT1                       TRUE
#define SPC5_PIT1_BASE                      0xFBF84000UL
#define SPC5_PIT1_CHANNELS                  2
#define SPC5_PIT1_PCTL                      158
#define SPC5_PIT1_ENABLE_CLOCK()            SPCSetPeripheralClockMode(SPC5_PIT1_PCTL, SPC5_PIT1_START_PCTL);
#define SPC5_PIT1_DISABLE_CLOCK()           SPCSetPeripheralClockMode(SPC5_PIT1_PCTL, SPC5_PIT1_STOP_PCTL);
#define SPC5_HAS_PIT1_CH0                   TRUE
#define SPC5_HAS_PIT1_CH1                   TRUE
#define SPC5_HAS_PIT1_CH2                   FALSE
#define SPC5_HAS_PIT1_CH3                   FALSE
#define SPC5_HAS_PIT1_CH4                   FALSE
#define SPC5_HAS_PIT1_CH5                   FALSE
#define SPC5_HAS_PIT1_CH6                   FALSE
#define SPC5_HAS_PIT1_CH7                   FALSE
#define SPC5_PIT1_CH0_HANDLER               vector240
#define SPC5_PIT1_CH1_HANDLER               vector241
#define SPC5_PIT1_CH0_INT_NUMBER            240
#define SPC5_PIT1_CH1_INT_NUMBER            241

/* STM Attributes */
#define SPC5_HAS_STM0                       TRUE
#define SPC5_HAS_STM1                       TRUE
#define SPC5_HAS_STM2                       TRUE

