Btuncer1/GolfGateEpas/SPC5Golfv2/components/spc58xgxx_platform_component_rla/lib/include/spc58xg_registry.h
#define SPC5_HAS_CAN_SUB_1_M_CAN_3             TRUE
#define SPC5_CAN_SUB_1_M_CAN_3_PTCL            196
#define SPC5_CAN_SUB_1_M_CAN_3_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_3_PTCL, SPC5_CAN_SUB_1_M_CAN_3_START_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_3_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_3_PTCL, SPC5_CAN_SUB_1_M_CAN_3_STOP_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_3_L0_HANDLER      vector698
#define SPC5_CAN_SUB_1_M_CAN_3_L1_HANDLER      vector699
#define SPC5_CAN_SUB_1_M_CAN_3_L0_NUMBER       698
#define SPC5_CAN_SUB_1_M_CAN_3_L1_NUMBER       699

#define SPC5_HAS_CAN_SUB_1_M_CAN_4             TRUE
#define SPC5_CAN_SUB_1_M_CAN_4_PTCL            195
#define SPC5_CAN_SUB_1_M_CAN_4_ENABLE_CLOCK()  SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_4_PTCL, SPC5_CAN_SUB_1_M_CAN_4_START_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_4_DISABLE_CLOCK() SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_M_CAN_4_PTCL, SPC5_CAN_SUB_1_M_CAN_4_STOP_PTCL);
#define SPC5_CAN_SUB_1_M_CAN_4_L0_HANDLER      vector700
#define SPC5_CAN_SUB_1_M_CAN_4_L1_HANDLER      vector701
#define SPC5_CAN_SUB_1_M_CAN_4_L0_NUMBER       700
#define SPC5_CAN_SUB_1_M_CAN_4_L1_NUMBER       701

#define SPC5_HAS_CAN_SUB_1_RAM                 TRUE
#define SPC5_CAN_SUB_1_RAM_PTCL                202
#define SPC5_CAN_SUB_1_RAM_ENABLE_CLOCK()      SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_RAM_PTCL, SPC5_CAN_SUB_1_RAM_START_PTCL);
#define SPC5_CAN_SUB_1_RAM_DISABLE_CLOCK()     SPCSetPeripheralClockMode(SPC5_CAN_SUB_1_RAM_PTCL, SPC5_CAN_SUB_1_RAM_STOP_PTCL);

/* CAN SUBSYSTEM 2 attributes.*/       
#define SPC5_HAS_CAN_SUB_2_M_CAN_0             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_1             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_2             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_3             FALSE
#define SPC5_HAS_CAN_SUB_2_M_CAN_4             FALSE
#define SPC5_HAS_CAN_SUB_2_RAM                 FALSE

/* CLOCK CALIBRATION CONTROL UNIT */
#define SPC5_HAS_CCCU_0                        TRUE
#define SPC5_CCCU_0_PTCL                       62
#define SPC5_CCCU_0_ENABLE_CLOCK()             SPCSetPeripheralClockMode(SPC5_CCCU_0_PTCL, SPC5_CCCU_0_START_PTCL);
#define SPC5_CCCU_0_DISABLE_CLOCK()            SPCSetPeripheralClockMode(SPC5_CCCU_0_PTCL, SPC5_CCCU_0_STOP_PTCL);

#define SPC5_HAS_CCCU_1                        FALSE

/* SWT Attributes */
#define SPC5_HAS_SWT0                       TRUE
#define SPC5_SWT0_FCCU_CHANNEL              20U
#define SPC5_SWT0_BASE                      0xFC050000UL
#define SPC5_SWT0_HANDLER                   vector32
#define SPC5_SWT0_INT_NUMBER                32

#define SPC5_HAS_SWT1                       TRUE
#define SPC5_SWT1_FCCU_CHANNEL              19U
#define SPC5_SWT1_BASE                      0xFC054000UL
#define SPC5_SWT1_HANDLER                   vector33
#define SPC5_SWT1_INT_NUMBER                33

#define SPC5_HAS_SWT2                       TRUE
#define SPC5_SWT2_FCCU_CHANNEL              20U
#define SPC5_SWT2_BASE                      0xF4058000UL
#define SPC5_SWT2_HANDLER                   vector34
#define SPC5_SWT2_INT_NUMBER                34

#define SPC5_HAS_SWT3                       TRUE
#define SPC5_SWT3_FCCU_CHANNEL              17U
#define SPC5_SWT3_BASE                      0xF405C000UL
#define SPC5_SWT3_HANDLER                   vector35
#define SPC5_SWT3_INT_NUMBER                35

/* I2C Attributes */
#define SPC5_HAS_I2C                        1
#define SPC5_I2C0_PCTL                      101
#define SPC5_I2C0_HANDLER                   vector440
#define	SPC5_I2C0_INT_NUMBER                440

/* SARADC Attributes */
#define SPC5_HAS_SARADC12_0                 TRUE
#define SPC5_SARADC12_0_PCTL                127
#define SPC5_SARADC12_0_HANDLER             vector528
#define SPC5_SARADC12_0_INT_NUMBER          528

#define SPC5_HAS_SARADC12_1                 TRUE
#define SPC5_SARADC12_1_PCTL                255
#define SPC5_SARADC12_1_HANDLER             vector529
#define SPC5_SARADC12_1_INT_NUMBER          529

#define SPC5_HAS_SARADC12_2                 TRUE
#define SPC5_SARADC12_2_PCTL                126
#define SPC5_SARADC12_2_HANDLER             vector530
#define SPC5_SARADC12_2_INT_NUMBER          530

#define SPC5_HAS_SARADC12_3                 TRUE
#define SPC5_SARADC12_3_PCTL                254
#define SPC5_SARADC12_3_HANDLER             vector531
#define SPC5_SARADC12_3_INT_NUMBER          531

#define SPC5_HAS_SARADC12_4                 FALSE
#define SPC5_HAS_SARADC12_5                 FALSE
#define SPC5_HAS_SARADC12_6                 FALSE

#define SPC5_HAS_SARADC12_SV                TRUE
#define SPC5_SARADC12_SV_PCTL               112
#define SPC5_SARADC12_SV_HANDLER            vector543
#define SPC5_SARADC12_SV_INT_NUMBER         543

#define SPC5_HAS_SARADC12_SV_1              FALSE

#define SPC5_HAS_SARADC10_0                 TRUE
#define SPC5_SARADC10_0_PCTL                119
#define SPC5_SARADC10_0_HANDLER             vector554
#define SPC5_SARADC10_0_INT_NUMBER          554

#define SPC5_HAS_SARADC10_1                 TRUE
#define SPC5_SARADC10_1_PCTL                247
#define SPC5_SARADC10_1_HANDLER             vector555
#define SPC5_SARADC10_1_INT_NUMBER          555

#define SPC5_HAS_SARADC10_STANDBY           TRUE
#define SPC5_SARADC10_STANDBY_PCTL          114
#define SPC5_SARADC10_STANDBY_HANDLER       vector557
#define SPC5_SARADC10_STANDBY_INT_NUMBER    557

#define SPC5_SARADC_MASK_REG_NUM            3U

/* FCCU Attributes */
#define SPC5_HAS_FCCU                       TRUE
#define SPC5_FCCU_BASE                      0xFBF58000UL

/* eMIOS attributes.*/
#define SPC5_HAS_EMIOS0                     TRUE
#define SPC5_EMIOS0_BASE                    0xF7C38000UL
#define SPC5_EMIOS0_PCTL                    241
#define SPC5_EMIOS0_GFR_F0F1_HANDLER        vector900
#define SPC5_EMIOS0_GFR_F2F3_HANDLER        vector901
#define SPC5_EMIOS0_GFR_F4F5_HANDLER        vector902
#define SPC5_EMIOS0_GFR_F6F7_HANDLER        vector903
#define SPC5_EMIOS0_GFR_F8F9_HANDLER        vector904
#define SPC5_EMIOS0_GFR_F10F11_HANDLER      vector905
#define SPC5_EMIOS0_GFR_F12F13_HANDLER      vector906
#define SPC5_EMIOS0_GFR_F14F15_HANDLER      vector907
#define SPC5_EMIOS0_GFR_F16F17_HANDLER      vector908
#define SPC5_EMIOS0_GFR_F18F19_HANDLER      vector909
#define SPC5_EMIOS0_GFR_F20F21_HANDLER      vector910
#define SPC5_EMIOS0_GFR_F22F23_HANDLER      vector911
#define SPC5_EMIOS0_GFR_F24F25_HANDLER      vector912
#define SPC5_EMIOS0_GFR_F26F27_HANDLER      vector913
#define SPC5_EMIOS0_GFR_F28F29_HANDLER      vector914
#define SPC5_EMIOS0_GFR_F30F31_HANDLER      vector915
#define SPC5_EMIOS0_GFR_F0F1_NUMBER         900
#define SPC5_EMIOS0_GFR_F2F3_NUMBER         901
#define SPC5_EMIOS0_GFR_F4F5_NUMBER         902
#define SPC5_EMIOS0_GFR_F6F7_NUMBER         903
#define SPC5_EMIOS0_GFR_F8F9_NUMBER         904
#define SPC5_EMIOS0_GFR_F10F11_NUMBER       905
#define SPC5_EMIOS0_GFR_F12F13_NUMBER       906
#define SPC5_EMIOS0_GFR_F14F15_NUMBER       907
#define SPC5_EMIOS0_GFR_F16F17_NUMBER       908
#define SPC5_EMIOS0_GFR_F18F19_NUMBER       909
#define SPC5_EMIOS0_GFR_F20F21_NUMBER       910
#define SPC5_EMIOS0_GFR_F22F23_NUMBER       911
#define SPC5_EMIOS0_GFR_F24F25_NUMBER       912
#define SPC5_EMIOS0_GFR_F26F27_NUMBER       913
#define SPC5_EMIOS0_GFR_F28F29_NUMBER       914
#define SPC5_EMIOS0_GFR_F30F31_NUMBER       915

#define SPC5_HAS_EMIOS1                     TRUE
#define SPC5_EMIOS1_BASE                    0xFBC38000UL
#define SPC5_EMIOS1_PCTL                    240
#define SPC5_EMIOS1_GFR_F0F1_HANDLER        vector916
#define SPC5_EMIOS1_GFR_F2F3_HANDLER        vector917
#define SPC5_EMIOS1_GFR_F4F5_HANDLER        vector918
#define SPC5_EMIOS1_GFR_F6F7_HANDLER        vector919
#define SPC5_EMIOS1_GFR_F8F9_HANDLER        vector920
#define SPC5_EMIOS1_GFR_F10F11_HANDLER      vector921
#define SPC5_EMIOS1_GFR_F12F13_HANDLER      vector922
#define SPC5_EMIOS1_GFR_F14F15_HANDLER      vector923
#define SPC5_EMIOS1_GFR_F16F17_HANDLER      vector924
#define SPC5_EMIOS1_GFR_F18F19_HANDLER      vector925
#define SPC5_EMIOS1_GFR_F20F21_HANDLER      vector926
#define SPC5_EMIOS1_GFR_F22F23_HANDLER      vector927
#define SPC5_EMIOS1_GFR_F24F25_HANDLER      vector928
#define SPC5_EMIOS1_GFR_F26F27_HANDLER      vector929
#define SPC5_EMIOS1_GFR_F28F29_HANDLER      vector930
#define SPC5_EMIOS1_GFR_F30F31_HANDLER      vector931
#define SPC5_EMIOS1_GFR_F0F1_NUMBER         916
#define SPC5_EMIOS1_GFR_F2F3_NUMBER         917
#define SPC5_EMIOS1_GFR_F4F5_NUMBER         918
#define SPC5_EMIOS1_GFR_F6F7_NUMBER         919
#define SPC5_EMIOS1_GFR_F8F9_NUMBER         920
#define SPC5_EMIOS1_GFR_F10F11_NUMBER       921
#define SPC5_EMIOS1_GFR_F12F13_NUMBER       922
#define SPC5_EMIOS1_GFR_F14F15_NUMBER       923
#define SPC5_EMIOS1_GFR_F16F17_NUMBER       924
#define SPC5_EMIOS1_GFR_F18F19_NUMBER       925
#define SPC5_EMIOS1_GFR_F20F21_NUMBER       926
#define SPC5_EMIOS1_GFR_F22F23_NUMBER       927
#define SPC5_EMIOS1_GFR_F24F25_NUMBER       928
#define SPC5_EMIOS1_GFR_F26F27_NUMBER       929
#define SPC5_EMIOS1_GFR_F28F29_NUMBER       930
#define SPC5_EMIOS1_GFR_F30F31_NUMBER       931

#define SPC5_HAS_EMIOS2                     FALSE

/* WKPU Attributes */
#define SPC5_HAS_WKPU0                      TRUE
#define SPC5_WKPU0_BASE                     0xF7F98000UL
#define SPC5_WKPU0_IRQ0_HANDLER             vector247
#define SPC5_WKPU0_IRQ1_HANDLER             vector248
#define SPC5_WKPU0_IRQ2_HANDLER             vector249
#define SPC5_WKPU0_IRQ3_HANDLER             vector250
#define SPC5_WKPU0_IRQ0_INT_NUMBER          247
#define SPC5_WKPU0_IRQ1_INT_NUMBER          248
#define SPC5_WKPU0_IRQ2_INT_NUMBER          249
#define SPC5_WKPU0_IRQ3_INT_NUMBER          250

#define SPC5_HAS_WKPU1                      FALSE

#define SPC5_WKPU_SUPPORT_EXT_SRC           TRUE

/* RTC attributes.*/
#define SCP5_RTC_RTC_HANDLER                vector224
#define SCP5_RTC_API_HANDLER                vector225
#define SCP5_RTC_RTC_INT_NUMBER             224
#define SCP5_RTC_API_INT_NUMBER             225


/** @} */

#endif /* SPC5_REGISTRY_H */

/** @} */
